ruby-rails-and-ms-sql-server/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2023-04-26 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ruby, Rails and MS SQL server</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../pdn.css" type="text/css"/>
<link rel='stylesheet' href='https://use.fontawesome.com/releases/v5.8.2/css/all.css' integrity='sha384-oS3vJWv+0UjzBfQzYUhtDYW+Pj2yciDJxpsK1OYPAYjqT085Qq/1cq5FLXAZQ7Ay' crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">
<div class='cover'>
<div class='cover-card'>
<div class='author-name'>Boško Ivanišević</div>
<div class='author-job'>Developer, Theoretical Physicist</div>
<div class='author-bio mbm'>Ruby, JavaScript, Elixir, C++ and few more</div>
<nav id='sidenav' clas='nav'>
<ul class='nav-list'>
<li class='nav-item'><a href='../index.html'>Home</a1> <span>/</span></li>
<li class='nav-item'><a href='../about.html'>About</a> <span>/</span></li>
</ul>
</nav>
<div class='social-links'>
<ul>
<li><a href='https://ruby.social/@bosko' class='social-link-item' target='_blank' rel='me'>
<i class='fab fa-mastodon'></i>
</a></li>
<li><a href='https://twitter.com/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-twitter'></i>
</a></li>
<li><a href='https://linkedin.com/in/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-linkedin'></i>
</a></li>
<li><a href='https://github.com/bosko' class='social-link-item' target='_blank'>
<i class='fab fa-github'></i>
</a></li>
<li><a href='https://stackoverflow.com/users/1665470/boško-ivanišević' class='social-link-item' target='_blank'>
<i class='fab fa-stack-overflow'></i>
</a></li>
<li><a href='https://dev.to/bosko' class='social-link-item' target='_blank'>
  <i class='fab fa-dev' title='bosko's DEV Profile'></i>
</a></li>
</ul>
</div>
</div>
</div>
</div>
<main id="content" class="content">
<header>
<h1 class="title">Ruby, Rails and MS SQL server</h1>
<p class="subtitle" role="doc-subtitle">2010-02-18</p>
</header><p>
Setting up Rails and Ruby to use MS SQL server was always painful
task. Fortunately things have changed - a lot! With new <a href="http://github.com/rails-sqlserver/2000-2005-adapter">Rails SQL
Server 2000, 2005 and 2008 Adapter</a> and Christian Werner’s <a href="http://www.ch-werner.de/rubyodbc">ruby-odbc
gem</a> you can do it in a few minutes.
</p>

<p>
If you want to use these gems on Windows grab Ruby installation from
<a href="http://www.rubyinstaller.org">RubyInstaller</a> site and be sure to install <a href="http://rubyforge.org/frs/download.php/66888/devkit-3.4.5r3-20091110.7z">DevKit</a> prior to installing
ruby-odbc.
</p>

<p>
Versions of ruby-odbc before 0.9999 do not work on mingw based
(RubyInstaller) Ruby. Luckily author was very fast and made new
version very quickly after I sent him a patch. Thanks Christian!
</p>

<p>
Both gems work well on Ruby 1.8.6 and 1.9.1 Ruby versions on Windows
with old ActiveRecords, but I hope rails adapter will be ported to
ActiveRecords 3 soon.
</p>
</main>
</body>
</html>